# GetDuctSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..GetDuctSettings Method
DuctSettings Class See Also
---
Get the duct settings of the project.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static DuctSettings GetDuctSettings(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetDuctSettings ( _
	document As Document _
) As DuctSettings
```

Visual C++
---
```text
public:
static DuctSettings^ GetDuctSettings(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The duct settings of the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace